# -- coding: utf-8 --

allowed_classes = {
    'Assassin': 'Убийца',
    'Hunter': 'Охотник',
    'Warrior': 'Воин',
    'Mage': 'Маг',
    'Engineer': 'Инженер',
}

allowed_gamemode = {
    "Custom Game Solo": 'Пользовательская игра Соло',
    "Solo": 'Соло',
    "Custom Game Duo": 'Пользовательская игра Дуо',
    "Duo": 'Дуо',
    "Custom Game Quad": 'Пользовательская игра Отряд',
    "Squad": 'Отряд',
    "Quad": 'Отряд',
    "Custom Game Trio": 'Пользовательская игра Трио',
    "Realm Wars": 'Командный бой насмерть',
    "Wars": 'Командный бой насмерть',
}

dict_of_platforms = {
        'STEAM': 5,
        '5': 5,
        'SWITCH': 22,
        '22': 22,
        'XBOX': 10,
        '10': 10,
        'PS4': 9,
        '9': 9
}

STATUS_MESSAGES = {
    0: '⚫ Не в сети',
    1: '🟢 В лобби',
    2: '🟡 В корабле',
    3: '🔴 В матче',
    4: '🟢 Онлайн',
    5: '⚫ Не в сети',
}

placement_medals = {
    1: "🥇",
    2: "🥈",
    3: "🥉",
}
